espressif/esp-idf/components/soc/esp32s2beta/include/soc/interrupt_reg.h
#define DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x128)
/* DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x12C)
/* DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x130)
/* DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x134)
/* DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x138)
/* DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x13C)
/* DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x140)
/* DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_S  0

#define DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x144)
/* DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP  0x0000001F
#define DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_M  ((DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_V)<<(DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_S))
#define DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_V  0x1F
#define DPORT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_S  0

#define DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x148)
/* DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP  0x0000001F
#define DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_M  ((DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_V)<<(DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_S))
#define DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_V  0x1F
#define DPORT_PRO_SPI0_REJECT_CACHE_INTR_MAP_S  0

#define DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x14C)
/* DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP  0x0000001F
#define DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_M  ((DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_V)<<(DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_S))
#define DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_V  0x1F
#define DPORT_PRO_SPI1_REJECT_CPU_INTR_MAP_S  0

#define DPORT_PRO_DMA_COPY_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x150)
/* DPORT_PRO_DMA_COPY_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_DMA_COPY_INTR_MAP  0x0000001F
#define DPORT_PRO_DMA_COPY_INTR_MAP_M  ((DPORT_PRO_DMA_COPY_INTR_MAP_V)<<(DPORT_PRO_DMA_COPY_INTR_MAP_S))
#define DPORT_PRO_DMA_COPY_INTR_MAP_V  0x1F
#define DPORT_PRO_DMA_COPY_INTR_MAP_S  0

#define DPORT_PRO_SPI4_DMA_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x154)
/* DPORT_PRO_SPI4_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_SPI4_DMA_INT_MAP  0x0000001F
#define DPORT_PRO_SPI4_DMA_INT_MAP_M  ((DPORT_PRO_SPI4_DMA_INT_MAP_V)<<(DPORT_PRO_SPI4_DMA_INT_MAP_S))
#define DPORT_PRO_SPI4_DMA_INT_MAP_V  0x1F
#define DPORT_PRO_SPI4_DMA_INT_MAP_S  0

#define DPORT_PRO_SPI_INTR_4_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x158)
/* DPORT_PRO_SPI_INTR_4_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define DPORT_PRO_SPI_INTR_4_MAP  0x0000001F
#define DPORT_PRO_SPI_INTR_4_MAP_M  ((DPORT_PRO_SPI_INTR_4_MAP_V)<<(DPORT_PRO_SPI_INTR_4_MAP_S))
#define DPORT_PRO_SPI_INTR_4_MAP_V  0x1F
#define DPORT_PRO_SPI_INTR_4_MAP_S  0

#define DPORT_PRO_INTR_STATUS_0_REG          (DR_REG_INTERRUPT_BASE + 0x15C)
/* DPORT_PRO_INTR_STATUS_0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_INTR_STATUS_0  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_0_M  ((DPORT_PRO_INTR_STATUS_0_V)<<(DPORT_PRO_INTR_STATUS_0_S))
#define DPORT_PRO_INTR_STATUS_0_V  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_0_S  0

#define DPORT_PRO_INTR_STATUS_1_REG          (DR_REG_INTERRUPT_BASE + 0x160)
/* DPORT_PRO_INTR_STATUS_1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_INTR_STATUS_1  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_1_M  ((DPORT_PRO_INTR_STATUS_1_V)<<(DPORT_PRO_INTR_STATUS_1_S))
#define DPORT_PRO_INTR_STATUS_1_V  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_1_S  0

#define DPORT_PRO_INTR_STATUS_2_REG          (DR_REG_INTERRUPT_BASE + 0x164)
/* DPORT_PRO_INTR_STATUS_2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_INTR_STATUS_2  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_2_M  ((DPORT_PRO_INTR_STATUS_2_V)<<(DPORT_PRO_INTR_STATUS_2_S))
#define DPORT_PRO_INTR_STATUS_2_V  0xFFFFFFFF
#define DPORT_PRO_INTR_STATUS_2_S  0

#define INTERRUPT_CLOCK_GATE_REG          (DR_REG_INTERRUPT_BASE + 0x168)
/* DPORT_PRO_NMI_MASK_HW : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_NMI_MASK_HW  (BIT(1))
#define DPORT_PRO_NMI_MASK_HW_M  (BIT(1))
#define DPORT_PRO_NMI_MASK_HW_V  0x1
#define DPORT_PRO_NMI_MASK_HW_S  1
/* INTERRUPT_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define INTERRUPT_CLK_EN  (BIT(0))
#define INTERRUPT_CLK_EN_M  (BIT(0))
#define INTERRUPT_CLK_EN_V  0x1
#define INTERRUPT_CLK_EN_S  0

#define INTERRUPT_DATE_REG          (DR_REG_INTERRUPT_BASE + 0xFFC)
/* INTERRUPT_DATE : R/W ;bitpos:[27:0] ;default: 28'h1809110 ; */
/*description: */
#define INTERRUPT_DATE  0x0FFFFFFF
#define INTERRUPT_DATE_M  ((INTERRUPT_DATE_V)<<(INTERRUPT_DATE_S))
#define INTERRUPT_DATE_V  0xFFFFFFF
#define INTERRUPT_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_INTERRUPT_REG_H_ */


